# How many women survived on the _Titanic_?

***

In [46]:
import csv
import pandas as pd

PATH = "./Datasets/titanic.csv"

## Custom Python

In [109]:
databank = list()
with open(PATH, "r") as fr:
    reader = csv.reader(fr, delimiter=",")
    for line in reader:
        databank.append(line)

In [112]:
len(databank)  # 892 --> Databank is refreshed.

892

## Quick Solution

In [115]:
# FIRST STEP: Get a new object holding women data from original databank
data_female = []
for i in range(1, len(databank)):
    if databank[i][4] == "female":
        data_female.append(databank[i])
# SECOND STEP: Get another new object holding survivors from women databank
data_female_survived = []
for i in range(len(data_female)):
    if data_female[i][1] == '1':
        data_female_survived.append(data_female[i])
# THIRD STEP: Get length of remaining data
len(data_female_survived)

233

## Enhanced Solution

In [116]:
# ALTERNATE: Remove men data from original object
# RETURN: Object (list of lists) containing only women on Titanic
# ALTERNATE: Remove dead data from original subject
# RETURN: Object (list of lists) containing women on Titanic who lived
# THIRD STEP: Get length of remaining data

## Pandas

In [117]:
df = pd.read_csv(PATH)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
ARG_WOMEN = (df["Sex"] == "female")
ARG_LIVED = (df["Survived"] == 1)

len(df[ARG_WOMEN & ARG_LIVED])

233

In [119]:
len(df[df["Sex"] != "female"])

577

In [120]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [121]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [122]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [123]:
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [124]:
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [125]:
df.age

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [126]:
df[df.age > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

## Select dataframe such that the return dataframe has more pets than children

In [127]:
df[df.num_pets > df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [131]:
df[(df.age > 40) & (df.num_pets > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

### More Pandas

In [132]:
df.drop(['age', 'num_children'], axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [140]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [139]:

sum(df.age) / len(df.age)

36.666666666666664

In [141]:
import numpy as np

df[['age', 'num_pets', 'num_children']].apply(lambda col: np.mean(col, axis=0))

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64